load.yml
config:
  target: "https://localhost:3000"
  plugins:
    expect: {}
  phases:
    - duration: 20
      arrivalRate: 20
      name: First load
scenarios:
  - flow:
      - get:
          url: "/health"
          capture:
            - json: "$.threadId"
              as: threadId
          expect:
            - statusCode: 200
            - contentType: json
            - equals:
                - 0
                - "{{ threadId }}"